# ImportBackground Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ImportBackground Property
ParameterTypeId Class See Also
---
"Draw Layer"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ImportBackground { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportBackground As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ImportBackground {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace